# Ceci n'est pas un fichier à remettre, il sert uniquement à visualiser le résultat sur le terminal (et débugger par conséquent)

from .part_5 import part_5

def main():
    turns = int(input("Enter the amount of turns: "))
    board = list(map(str, input("Enter the board of 16 strings (separated by a comma): ").split(",")))
    part_5(turns, board)

if __name__ == "__main__":
    main()


# Pour tester
"""
___x_.________._,_______.________,_________..___._,_.__._____.____.,_________.__.___,.____________._.,_.__________.___,__.______..__.__,____._______.___,.__.___.________,______._________,____..._____.___,__..___.._______,_______________.,________._._____,____.._______.__
"""

# ____.________._,_______.________,_________..___._,_.__._____.____.,_________.__.___,.____________._.,_.__________.___,__.______..__.__,____._______.___,.__.___.________,______._________,____..._____.___,__..___.._______,_______________.,________._._____,____.._______.__

